import unittest
import pymysql

conn = pymysql.connect(
        host='localhost',
        user='root',
        password='root',
        database='Boba'
)

class TestSQlQueries(unittest.TestCase):

    def test_select_all_material(self, cursor=None):
        cursor.execute("SELECT * FROM partners_import")
        result = cursor.fetchall()
        expected = [('1', 'ЗАО', 'База Строитель', 'Иванова Александра Ивановна', 'aleksandraivanova@ml.ru', '493 123 45 67', '652050, Кемеровская область, город Юрга, ул. Лесная, 15', '2222455179', '7'),
                    ('2', 'ООО', 'Паркет 29', 'Петров Василий Петрович', 'vppetrov@vl.ru', '987 123 56 78', '164500, Архангельская область, город Северодвинск, ул. Строителей, 18', '3333888520', '7'),
                    ('3', 'ПАО', 'Стройсервис', 'Соловьев Андрей Николаевич', 'ansolovev@st.ru', '812 223 32 00', '188910, Ленинградская область, город Приморск, ул. Парковая, 21', '4440391035', '7'),
                    ('4', 'ОАО', 'Ремонт и отделка', 'Воробьева Екатерина Валерьевна', 'ekaterina.vorobeva@ml.ru', '444 222 33 11', '143960, Московская область, город Реутов, ул. Свободы, 51', '1111520857', '5'),
                    ('5', 'ЗАО', 'МонтажПро', 'Степанов Степан Сергеевич', 'stepanov@stepan.ru', '912 888 33 33', '309500, Белгородская область, город Старый Оскол, ул. Рабочая, 122', '5552431140', '10')]
        self.assertEqual(result,expected)
        conn.close()

        def test_add_partner(self):
            cursor.execute(f'INSERT INTO partners_init VALUES ("ЗАО","Инструментоз", "Степанов Андрей Тимофеевич", "andrilove@gm.ru","880 055 53 53","568921,Республика Удмуртия,город Ижевск, ул.Инструментальная 28","0987454208","6")')
            result = cursor.fetchall()
            expected = [('1', 'ЗАО', 'База Строитель', 'Иванова Александра Ивановна', 'aleksandraivanova@ml.ru', '493 123 45 67', '652050, Кемеровская область, город Юрга, ул. Лесная, 15', '2222455179', '7'),
                        ('2', 'ООО', 'Паркет 29', 'Петров Василий Петрович', 'vppetrov@vl.ru', '987 123 56 78', '164500, Архангельская область, город Северодвинск, ул. Строителей, 18', '3333888520', '7'),
                        ('3', 'ПАО', 'Стройсервис', 'Соловьев Андрей Николаевич', 'ansolovev@st.ru', '812 223 32 00','188910, Ленинградская область, город Приморск, ул. Парковая, 21', '4440391035', '7'),
                        ('4', 'ОАО', 'Ремонт и отделка', 'Воробьева Екатерина Валерьевна', 'ekaterina.vorobeva@ml.ru', '444 222 33 11', '143960, Московская область, город Реутов, ул. Свободы, 51', '1111520857', '5'),
                        ('5', 'ЗАО', 'МонтажПро', 'Степанов Степан Сергеевич', 'stepanov@stepan.ru', '912 888 33 33', '309500, Белгородская область, город Старый Оскол, ул. Рабочая, 122', '5552431140', '10')]

            self.assertEqual(result, expected)
            conn.close()

if __name__ == "__main__":
